---
kind: enumMember
id: F:Autodesk.Revit.DB.ExportEnergyModelType.SpatialElement
enum: Autodesk.Revit.DB.ExportEnergyModelType
source: html/a5e9c660-febe-e1c0-af58-47a55bde5443.htm
---
# Autodesk.Revit.DB.ExportEnergyModelType.SpatialElement

Energy model based on rooms or spaces.